In [19]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [20]:
data=pd.read_csv(r"C:\Users\HP\Desktop\titanic.csv")

In [21]:
data.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [22]:
data.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

In [23]:
data.drop(['Pclass', 'Name'],axis=1,inplace=True)

In [24]:
data.head()

,Survived,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,male,22.0,1,0,7.2500
1,1,female,38.0,1,0,71.2833
2,1,female,26.0,0,0,7.9250
3,1,female,35.0,1,0,53.1000
4,0,male,35.0,0,0,8.0500

In [25]:
gender=pd.get_dummies(data['Sex'],drop_first=True)
gender[:5]

   male
0     1
1     0
2     0
3     0
4     1

In [26]:
titanic=data.drop(['Sex'],axis=1,inplace=True)

In [27]:
d1=pd.concat([data,gender],axis=1)
d1.head()

,Survived,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,male
0,0,22.0,1,0,7.2500,1
1,1,38.0,1,0,71.2833,0
2,1,26.0,0,0,7.9250,0
3,1,35.0,1,0,53.1000,0
4,0,35.0,0,0,8.0500,1

In [30]:
X=d1.iloc[:,0:5]
X[:2]

   Survived   Age  Siblings/Spouses Aboard  Parents/Children Aboard     Fare
0         0  22.0                        1                        0   7.2500
1         1  38.0                        1                        0  71.2833

In [31]:
Y=d1["male"]

In [32]:
d1.isnull().sum()

Survived                   0
Age                        0
Siblings/Spouses Aboard    0
Parents/Children Aboard    0
Fare                       0
male                       0
dtype: int64

In [42]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(d1,Y,test_size=0.2,random_state=50)

In [64]:
from sklearn.neighbors import KNeighborsClassifier
knn=KNeighborsClassifier(n_neighbors=2)

In [65]:

knn.fit(X_train,Y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
           metric_params=None, n_jobs=None, n_neighbors=2, p=2,
           weights='uniform')

In [66]:
knn.score(X_train,Y_train)

0.8998589562764457

In [67]:
knn.score(X_test,Y_test)

0.7640449438202247

In [68]:
predict=knn.predict(X_test)

In [69]:
from sklearn.metrics import classification_report,confusion_matrix

In [80]:
print(confusion_matrix(Y_test,predict))

[[56 14]
 [28 80]]

In [79]:
print(classification_report(Y_test,predict))

              precision    recall  f1-score   support

           0       0.67      0.80      0.73        70
           1       0.85      0.74      0.79       108

   micro avg       0.76      0.76      0.76       178
   macro avg       0.76      0.77      0.76       178
weighted avg       0.78      0.76      0.77       178